import tushare as ts

#浦发银行 (600000) 包钢股份 (600010) 华夏银行 (600015)
#民生银行 (600016) 上港集团 (600018) 中国石化 (600028)
#中信证券 (600030) 三一重工 (600031) 招商银行 (600036)
#保利地产 (600048) 中国联通 (600050) 特变电工 (600089)

codes = ['600000', '600010', '600015', '600016', '600018', '600028', '600030', '600031', '600036', '600048', '600050', '600089']

#df = ts.get_k_data('600000')
#df.to_csv('浦发银行近一年半的前复权日线行情.csv')
for code in codes:
    df = ts.get_k_data('600000', ktype='5')
    df.to_csv('浦发银行近期5分钟行情.csv', index=False, mode='a', )


# df.to_sql()
